### Terraform Plan Result - Plan Failed

### OK Estimated Monthly Cost: $0.00

<details>
<summary>Plan details (click to expand)</summary>

```
## Category: network-ec2-vpc
  Files: 15

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v6.32.1...
- Installed hashicorp/aws v6.32.1 (signed by HashiCorp)

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
=== Auto-import existing resources ===
Auto-import done: imported=0 skipped=0
WARN network-ec2-vpc: tfsec found issues (non-blocking)
[32m[1mSuccess![0m The configuration is valid.
[0m
Acquiring state lock. This may take a few moments...
data.aws_s3_bucket.remediation_vpc_flow_logs_bucket: Reading...
data.aws_security_groups.default: Reading...
data.aws_caller_identity.current: Reading...
data.aws_iam_instance_profile.remediation_instance_profile: Reading...
data.aws_region.current: Reading...
data.aws_partition.current: Reading...
data.aws_availability_zones.available: Reading...
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_subnets.current: Reading...
data.aws_route_table.existing_route_table: Reading...
data.aws_subnets.default: Reading...
data.aws_subnets.private: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=132410971304]
data.aws_availability_zones.available: Read complete after 1s [id=ap-northeast-2]
data.aws_route_table.existing_route_table: Read complete after 1s [id=rtb-0c851bd85a6481725]
data.aws_subnets.current: Read complete after 1s [id=ap-northeast-2]
data.aws_subnets.default: Read complete after 1s [id=ap-northeast-2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_eip.remediation_nat_eip[0] will be created
  + resource "aws_eip" "remediation_nat_eip" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + region               = "ap-northeast-2"
      + tags_all             = (known after apply)
    }

  # aws_instance.remediation_ec2_instance will be created
  + resource "aws_instance" "remediation_ec2_instance" {
      + ami                                  = (known after apply)
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + force_destroy                        = false
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "AmazonEC2RoleforSSM"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_group_id                   = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + region                               = "ap-northeast-2"
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "remediation-ec2-instance"
        }
      + tags_all                             = {
          + "Name" = "remediation-ec2-instance"
        }
      + tenancy                              = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_internet_gateway.remediation_igw will be created
  + resource "aws_internet_gateway" "remediation_igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "ap-northeast-2"
      + tags     = {
          + "Name" = "Remediation Internet Gateway"
        }
      + tags_all = {
          + "Name" = "Remediation Internet Gateway"
        }
      + vpc_id   = (known after apply)
    }

  # aws_nat_gateway.remediation_nat_gw will be created
  + resource "aws_nat_gateway" "remediation_nat_gw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + auto_provision_zones               = (known after apply)
      + auto_scaling_ips                   = (known after apply)
      + availability_mode                  = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + region                             = "ap-northeast-2"
      + regional_nat_gateway_address       = (known after apply)
      + regional_nat_gateway_auto_mode     = (known after apply)
      + route_table_id                     = (known after apply)
      + secondary_allocation_ids           = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "remediation-nat-gw"
        }
      + tags_all                           = {
          + "Name" = "remediation-nat-gw"
        }
      + vpc_id                             = (known after apply)
    }

  # aws_network_acl.remediation_acl will be created
  + resource "aws_network_acl" "remediation_acl" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 200
              + to_port         = 0
            },
          + {
              + action          = "deny"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 3389
              + ipv6_cidr_block = ""
              + protocol        = "tcp"
              + rule_no         = 100
              + to_port         = 3389
            },
        ]
      + owner_id   = (known after apply)
      + region     = "ap-northeast-2"
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "remediation_acl"
        }
      + tags_all   = {
          + "Name" = "remediation_acl"
        }
    }

  # aws_network_acl.remediation_network_acl will be created
  + resource "aws_network_acl" "remediation_network_acl" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + region     = "ap-northeast-2"
      + subnet_ids = (known after apply)
      + tags_all   = (known after apply)
    }

  # aws_networkfirewall_firewall.remediation_firewall will be created
  + resource "aws_networkfirewall_firewall" "remediation_firewall" {
      + arn                                 = (known after apply)
      + availability_zone_change_protection = false
      + delete_protection                   = false
      + firewall_policy_arn                 = (known after apply)
      + firewall_status                     = (known after apply)
      + id                                  = (known after apply)
      + name                                = "remediation-network-firewall"
      + region                              = "ap-northeast-2"
      + tags_all                            = (known after apply)
      + transit_gateway_owner_account_id    = (known after apply)
      + update_token                        = (known after apply)

      + subnet_mapping {
          + ip_address_type = (known after apply)
        }
    }

  # aws_networkfirewall_firewall_policy.remediation_firewall_policy will be created
  + resource "aws_networkfirewall_firewall_policy" "remediation_firewall_policy" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + name         = "remediation-firewall-policy"
      + region       = "ap-northeast-2"
      + tags_all     = (known after apply)
      + update_token = (known after apply)

      + firewall_policy {
          + stateless_default_actions          = [
              + "aws:forward_to_sfe",
            ]
          + stateless_fragment_default_actions = [
              + "aws:forward_to_sfe",
            ]

          + stateless_rule_group_reference {
              + priority     = 1
              + resource_arn = (known after apply)
            }
        }
    }

  # aws_networkfirewall_rule_group.remediation_stateless_rule_group will be created
  + resource "aws_networkfirewall_rule_group" "remediation_stateless_rule_group" {
      + arn          = (known after apply)
      + capacity     = 100
      + id           = (known after apply)
      + name         = "remediation-stateless-drop-ssh"
      + region       = "ap-northeast-2"
      + tags_all     = (known after apply)
      + type         = "STATELESS"
      + update_token = (known after apply)

      + rule_group {
          + rules_source {
              + stateless_rules_and_custom_actions {
                  + stateless_rule {
                      + priority = 1

                      + rule_definition {
                          + actions = [
                              + "aws:drop",
                            ]

                          + match_attributes {
                              + protocols = [
                                  + 6,
                                ]

                              + destination {
                                  + address_definition = "0.0.0.0/0"
                                }

                              + destination_port {
                                  + from_port = 22
                                  + to_port   = 22
                                }

                              + source {
                                  + address_definition = "0.0.0.0/0"
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # aws_route_table.remediation_private_rt will be created
  + resource "aws_route_table" "remediation_private_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "ap-northeast-2"
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "remediation-private-rt"
        }
      + tags_all         = {
          + "Name" = "remediation-private-rt"
        }
      + vpc_id           = "vpc-0565167ce4f7cc871"
    }

  # aws_route_table.remediation_public_rt will be created
  + resource "aws_route_table" "remediation_public_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "ap-northeast-2"
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "remediation-public-rt"
        }
      + tags_all         = {
          + "Name" = "remediation-public-rt"
        }
      + vpc_id           = "vpc-0565167ce4f7cc871"
    }

  # aws_route_table.remediation_rt will be created
  + resource "aws_route_table" "remediation_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "ap-northeast-2"
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "Remediation Route Table"
        }
      + tags_all         = {
          + "Name" = "Remediation Route Table"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.remediation_private_subnet_rt_association will be created
  + resource "aws_route_table_association" "remediation_private_subnet_rt_association" {
      + id             = (known after apply)
      + region         = "ap-northeast-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.remediation_public_subnet_rt_association will be created
  + resource "aws_route_table_association" "remediation_public_subnet_rt_association" {
      + id             = (known after apply)
      + region         = "ap-northeast-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.remediation_route_table_association will be created
  + resource "aws_route_table_association" "remediation_route_table_association" {
      + id             = (known after apply)
      + region         = "ap-northeast-2"
      + route_table_id = "rtb-0c851bd85a6481725"
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.remediation_rt_association[0] will be created
  + resource "aws_route_table_association" "remediation_rt_association" {
      + id             = (known after apply)
      + region         = "ap-northeast-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.remediation_rt_association[1] will be created
  + resource "aws_route_table_association" "remediation_rt_association" {
      + id             = (known after apply)
      + region         = "ap-northeast-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.remediation_sg will be created
  + resource "aws_security_group" "remediation_sg" {
      + arn                    = (known after apply)
      + description            = "Remediation security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "remediation-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "ap-northeast-2"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "remediation-sg"
        }
      + tags_all               = {
          + "Name" = "remediation-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_ssm_activation.remediation_ssm_activation will be created
  + resource "aws_ssm_activation" "remediation_ssm_activation" {
      + activation_code    = (known after apply)
      + description        = "Activate EC2 instance for AWS Systems Manager"
      + expiration_date    = (known after apply)
      + expired            = (known after apply)
      + iam_role           = "AmazonEC2RoleforSSM"
      + id                 = (known after apply)
      + name               = "remediation-ssm-activation"
      + region             = "ap-northeast-2"
      + registration_count = (known after apply)
      + registration_limit = 1
      + tags               = {
          + "Name" = "remediation-ssm-activation"
        }
      + tags_all           = {
          + "Name" = "remediation-ssm-activation"
        }
    }

  # aws_subnet.remediation_private_subnet will be created
  + resource "aws_subnet" "remediation_private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-northeast-2"
      + tags                                           = {
          + "Name" = "remediation-private-subnet"
        }
      + tags_all                                       = {
          + "Name" = "remediation-private-subnet"
        }
      + vpc_id                                         = "vpc-0565167ce4f7cc871"
    }

  # aws_subnet.remediation_public_subnet will be created
  + resource "aws_subnet" "remediation_public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-northeast-2"
      + tags                                           = {
          + "Name" = "remediation-public-subnet"
        }
      + tags_all                                       = {
          + "Name" = "remediation-public-subnet"
        }
      + vpc_id                                         = "vpc-0565167ce4f7cc871"
    }

  # aws_subnet.remediation_subnet will be created
  + resource "aws_subnet" "remediation_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-northeast-2"
      + tags                                           = {
          + "Name" = "remediation-subnet"
        }
      + tags_all                                       = {
          + "Name" = "remediation-subnet"
        }
      + vpc_id                                         = "vpc-0565167ce4f7cc871"
    }

  # aws_subnet.remediation_subnets[0] will be created
  + resource "aws_subnet" "remediation_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-northeast-2"
      + tags                                           = {
          + "Name" = "Remediation Subnet 1"
        }
      + tags_all                                       = {
          + "Name" = "Remediation Subnet 1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.remediation_subnets[1] will be created
  + resource "aws_subnet" "remediation_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-northeast-2"
      + tags                                           = {
          + "Name" = "Remediation Subnet 2"
        }
      + tags_all                                       = {
          + "Name" = "Remediation Subnet 2"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.remediation_vpc will be created
  + resource "aws_vpc" "remediation_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "ap-northeast-2"
      + tags                                 = {
          + "Name" = "Remediation VPC"
        }
      + tags_all                             = {
          + "Name" = "Remediation VPC"
        }
    }

  # aws_vpc_endpoint.remediation_ec2_endpoint will be created
  + resource "aws_vpc_endpoint" "remediation_ec2_endpoint" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + region                = "ap-northeast-2"
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "",
          + "sg-fedcba9876543210",
        ]
      + service_name          = "com.amazonaws.ap-northeast-2.ec2"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = [
          + "",
          + "subnet-fedcba9876543210",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0565167ce4f7cc871"
    }

  # aws_vpc_endpoint_policy.remediation_ec2_endpoint_policy will be created
  + resource "aws_vpc_endpoint_policy" "remediation_ec2_endpoint_policy" {
      + id              = (known after apply)
      + policy          = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ec2:Describe*",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region          = "ap-northeast-2"
      + vpc_endpoint_id = (known after apply)
    }

Plan: 27 to add, 0 to change, 0 to destroy.
::error::Terraform exited with code 1.

```

</details>

> Merging this PR will auto-apply these resources to AWS.